[
    {
        "id": 1,
        "title": "Vice Chancellor's Award for Best Graduating Student",
        "description": "Received the Vice Chancellor's Award as the Best Graduating Computer Engineering Student from the Federal University of Technology, Akure, Nigeria, having been on the Dean's List for nine semesters.",
        "date": "August 2024"
    },
    {
        "id": 2,
        "title": "Lead Machine Learning Researcher",
        "description": "Led a team at Federal University of Technology, Akure (July 2023 – March 2024) to develop a Student Grade Prediction Model, achieving 92% accuracy in forecasting WASSCE performance, published in a peer-reviewed journal.",
        "date": "July 2023 - March 2024"
    },
    {
        "id": 3,
        "title": "Outstanding ML Engineer Intern",
        "description": "Earned the Outstanding Intern Award at Chronicles Software Development Company (January 2023 – June 2023) for building an NLP-powered Chatbot Tutor, adopted by 500+ students for personalized learning.",
        "date": "January 2023 - June 2023"
    },
    {
        "id": 4,
        "title": "Community Impact Leader",
        "description": "Served as CDS President for ICT, NYSC, Ojodu LG (October 2024 – January 2025), implementing digital literacy programs that trained 200+ community members in software development and AI basics.",
        "date": "October 2024 - January 2025"
    },
    {
        "id": 5,
        "title": "Best Research Assistant and Student Researcher",
        "description": "Received recognition as the Best Research Assistant and Student Researcher at the Machine Learning Research Lab, Federal University of Technology, Akure, for outstanding contributions to machine learning research.",
        "date": "November 2023 - April 2024"
    },
    {
        "id": 6,
        "title": "Machine Learning Educator",
        "description": "Organized and delivered free weekend workshops on Machine Learning and Neural Networks in Lagos (December 2023), impacting 100+ students and professionals, with 90% reporting improved understanding.",
        "date": "December 2023"
    }
]