[
    {
        "id": 2,
        "title": "AI-Powered Task Management Application",
        "description": "This AI-powered Task Management Application is a comprehensive, web-based productivity platform designed for organizations to manage teams and operations more efficiently through automation and intelligent insights. It features a dynamic task management system with AI-assisted scheduling, auto-assignment, and smart prioritization, alongside built-in real-time chat, a social feed for company-wide updates, and a distributed file storage system similar to Google Drive. Employees can receive AI-generated task summaries, productivity suggestions, and reminders, while managers benefit from role-based dashboards, detailed reports, performance appraisals, and goal tracking. The system includes a custom payment mechanism for employee rewards, a secure URL shortener, and seamless Microsoft Outlook integration for syncing tasks from emails and meetings. With scalable AI capabilities such as predictive analytics, sentiment tracking, and a smart assistant chatbot, the platform transforms how work is organized, communicated, and optimized across teams.",
        "images": [
            "/assets/images/tm-signup.gif",
            "/assets/images/tm-login.gif",
            "/assets/images/task-management-demo.gif",
            "/assets/images/tm-pending.gif",
            "/assets/images/tm-report.gif",
            "/assets/images/tm-chat.gif",
            "/assets/images/tm-social.gif",
            "/assets/images/tm-storage.gif",
            "/assets/images/tm-learning.gif",
            "/assets/images/tm-calender.gif"
        ],
        "link": "https://github.com/oluwaseun-odufisan/NEGTM",
        "liveDemo": "https://negaitm.vercel.app"
    },
    {
        "id": 1,
        "title": "NEG AI Banking Platform",
        "description": "The NEG AI Banking Platform is a secure, modern digital banking solution designed for seamless financial management in Nigeria. It offers a suite of features powered by Node.js, MongoDB, Flutterwave, and Express.js. Users can manage digital wallets, check real-time balances, and perform instant internal or external transfers to Nigerian banks, all validated through Flutterwave’s account resolution API. The platform ensures security through JWT authentication, input sanitization, and rate limiting, while providing detailed transaction email alerts—debit alerts for senders with fee details and credit alerts for receivers. With real-time webhook support, comprehensive error logging, and a scalable, API-driven architecture, it caters to both individuals and businesses. The system delivers transparency, reliability, and ease of use for funding, transferring, and tracking finances. Additionally, the platform supports the payment of various bills, including electricity, waste management, school fees, government charges, religious donations, and more—offering everything expected from a modern fintech application.",
        "images": [
            "/assets/images/neg-bank.gif"
        ],
        "link": "https://github.com/oluwaseun-odufisan/NEGAIBANKING",
        "liveDemo": ""
    },
    {
        "id": 3,
        "title": "CarbuCarbu Ride-Sharing App",
        "description": "CarbuCarbu is a mobile-first ride-sharing application built with Expo, React Native, and Clerk for secure authentication, designed to connect users with drivers for seamless transportation. The app features a sleek tab-based navigation system with screens for home, rides, chat, and profile, integrated with Google Maps API for real-time ride booking and location services. Users can sign in or up using email/password or Google OAuth, manage profiles, view ride history, and process payments via Stripe. The UI is styled with Tailwind CSS via NativeWind, featuring a modern neon purple aesthetic and PlusJakartaSans fonts for a responsive design. The backend leverages serverless APIs with Neon database for user and ride management, ensuring scalability and performance. Key features include animated tab navigation, bottom sheet interfaces for ride details, and robust error handling for network and authentication issues. CarbuCarbu offers a user-friendly, secure, and efficient solution for urban mobility.",
        "images": [
            "/assets/images/welcomescreen1.png",
            "/assets/images/welcomescreen2.png",
            "/assets/images/welcomescreen3.png",
            "/assets/images/welcomescreen3.gif",
            "/assets/images/signinscreen.png",
            "/assets/images/signupscreen.gif",
            "/assets/images/homescreen2.png",
            "/assets/images/ridesscreen.png",
            "/assets/images/profilescreen.png",
            "/assets/images/findridescreen1.png",
            "/assets/images/findridescreen2.png",
            "/assets/images/selectridescreen1.png",
            "/assets/images/selectridescreen2.png",
            "/assets/images/bookridescreen.png",
            "/assets/images/confirmridescreen.png",
            "/assets/images/paymentscreen.png"
        ],
        "link": "https://github.com/oluwaseun-odufisan/CarbuCarbu",
        "liveDemo": ""
    }
]